Layer (type)                 Output Shape              Param #
=================================================================
input (InputLayer)           (None, 512, None, 1)      0
_________________________________________________________________
pad1 (ZeroPadding2D)         (None, 514, None, 1)      0
_________________________________________________________________
conv1 (Conv2D)               (None, 254, None, 96)     4800
_________________________________________________________________
bn1 (BatchNormalization)     (None, 254, None, 96)     384
_________________________________________________________________
relu1 (Activation)           (None, 254, None, 96)     0
_________________________________________________________________
mpool1 (MaxPooling2D)        (None, 126, None, 96)     0
_________________________________________________________________
pad2 (ZeroPadding2D)         (None, 128, None, 96)     0
_________________________________________________________________
conv2 (Conv2D)               (None, 62, None, 256)     614656
_________________________________________________________________
bn2 (BatchNormalization)     (None, 62, None, 256)     1024
_________________________________________________________________
relu2 (Activation)           (None, 62, None, 256)     0
_________________________________________________________________
mpool2 (MaxPooling2D)        (None, 30, None, 256)     0
_________________________________________________________________
pad3 (ZeroPadding2D)         (None, 32, None, 256)     0
_________________________________________________________________
conv3 (Conv2D)               (None, 30, None, 384)     885120
_________________________________________________________________
bn3 (BatchNormalization)     (None, 30, None, 384)     1536
_________________________________________________________________
relu3 (Activation)           (None, 30, None, 384)     0
_________________________________________________________________
pad4 (ZeroPadding2D)         (None, 32, None, 384)     0
_________________________________________________________________
conv4 (Conv2D)               (None, 30, None, 256)     884992
_________________________________________________________________
bn4 (BatchNormalization)     (None, 30, None, 256)     1024
_________________________________________________________________
relu4 (Activation)           (None, 30, None, 256)     0
_________________________________________________________________
pad5 (ZeroPadding2D)         (None, 32, None, 256)     0
_________________________________________________________________
conv5 (Conv2D)               (None, 30, None, 256)     590080
_________________________________________________________________
bn5 (BatchNormalization)     (None, 30, None, 256)     1024
_________________________________________________________________
relu5 (Activation)           (None, 30, None, 256)     0
_________________________________________________________________
mpool5 (MaxPooling2D)        (None, 9, None, 256)      0
_________________________________________________________________
pad6 (ZeroPadding2D)         (None, 9, None, 256)      0
_________________________________________________________________
fc6 (Conv2D)                 (None, 1, None, 4096)     9441280
_________________________________________________________________
bn6 (BatchNormalization)     (None, 1, None, 4096)     16384
_________________________________________________________________
relu6 (Activation)           (None, 1, None, 4096)     0
_________________________________________________________________
gapool6 (GlobalAveragePoolin (None, 4096)              0
_________________________________________________________________
reshape6 (Reshape)           (None, 1, 1, 4096)        0
_________________________________________________________________
pad7 (ZeroPadding2D)         (None, 1, 1, 4096)        0
_________________________________________________________________
fc7 (Conv2D)                 (None, 1, 1, 1024)        4195328
_________________________________________________________________
bn7 (BatchNormalization)     (None, 1, 1, 1024)        4096
_________________________________________________________________
relu7 (Activation)           (None, 1, 1, 1024)        0
_________________________________________________________________
norm (Lambda)                (None, 1, 1, 1024)        0
_________________________________________________________________
fc8 (Conv2D)                 (None, 1, 1, 1024)        1049600
=================================================================
Total params: 17,691,328
Trainable params: 17,678,592
Non-trainable params: 12,736
